examples/coupled/fcc/fcc_fixedParticles/openfoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	 2.0;
	format	 ascii;
	class	 dictionary;
	object	 blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
	(0 0 0)
	(2.0 0 0)
	(2.0 10.0 0)
	(0 10.0 0)
	(0 0 2.0)
	(2.0 0 2.0)
	(2.0 10.0 2.0)
	(0 10.0 2.0)
);

blocks
(
	hex (0 1 2 3 4 5 6 7) (5 200 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	top
	{
		type patch;
		faces
		(
			(3 7 6 2)
		);
	}
	bottom
	{
		type patch;
		faces
		(
			(1 5 4 0)
		);
	}
	streamwiseIn
	{
		type cyclic;
		neighbourPatch streamwiseOut;
		faces
		(
			(0 4 7 3)
		);
	}
	streamwiseOut
	{
		type cyclic;
		neighbourPatch streamwiseIn;
		faces
		(
			(2 6 5 1)
		);
	}
	front
	{
		type cyclic;
		neighbourPatch back;
		faces
		(
			(4 5 6 7)
		);
	}
	back
	{
		type cyclic;
		neighbourPatch front;
		faces
		(
			(0 3 2 1)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
